Table of Contents
 Class StagedCheckSection
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Single check section
[OpenModelClass("CI.Concrete.SingleCheckProject.StagedSection,CI.SingleCheckProject", "CI.Services.Concrete.ServicePoint.ISingleCheckSection,CI.ServiceTypes", typeof(CheckSection))]
public class StagedCheckSection : CheckSection
Inheritance
object
OpenObject
OpenElementId
CheckSection
StagedCheckSection
Inherited Members
 CheckSection.Description
 CheckSection.CheckMember
 CheckSection.ReinfSection
 CheckSection.Extremes
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 StagedCheckSection()
Constructor
public StagedCheckSection()
Properties
 StagesLoading
Stages loading
public StagesLoading StagesLoading { get; set; }
Property Value
StagesLoading
 Edit this page